perf/resultado_bbox_1_load_10.txt

> perf@1.0.0 artillery /home/hugo/Desktop/Arq de Soft/Tp1/2c21-tp-1/perf
> artillery "run" "load-bbox.yaml" "-e" "black_box_1"

Started phase 0 (Load), duration: 600s @ 17:43:31(-0300) 2021-10-16
Report @ 17:43:41(-0300) 2021-10-16
Elapsed time: 10 seconds
  Scenarios launched:  99
  Scenarios completed: 90
  Requests completed:  90
  Mean response/sec: 10.01
  Response time (msec):
    min: 900
    max: 914
    median: 901
    p95: 903
    p99: 910
  Codes:
    200: 90

Report @ 17:43:51(-0300) 2021-10-16
Elapsed time: 20 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10.02
  Response time (msec):
    min: 900
    max: 922
    median: 901
    p95: 903
    p99: 916
  Codes:
    200: 100

Report @ 17:44:01(-0300) 2021-10-16
Elapsed time: 30 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10.01
  Response time (msec):
    min: 900
    max: 909
    median: 901
    p95: 902
    p99: 906
  Codes:
    200: 100

Report @ 17:44:11(-0300) 2021-10-16
Elapsed time: 40 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 906
    median: 901
    p95: 902
    p99: 904.5
  Codes:
    200: 100

Report @ 17:44:21(-0300) 2021-10-16
Elapsed time: 50 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10.01
  Response time (msec):
    min: 900
    max: 905
    median: 901
    p95: 902
    p99: 904
  Codes:
    200: 100

Report @ 17:44:31(-0300) 2021-10-16
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10.01
  Response time (msec):
    min: 900
    max: 903
    median: 901
    p95: 902
    p99: 903
  Codes:
    200: 100

Report @ 17:44:41(-0300) 2021-10-16
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 904
    median: 901
    p95: 901.5
    p99: 903
  Codes:
    200: 100

Report @ 17:44:51(-0300) 2021-10-16
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 903
    median: 901
    p95: 901
    p99: 903
  Codes:
    200: 100

Report @ 17:45:01(-0300) 2021-10-16
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 906
    median: 901
    p95: 903
    p99: 904.5
  Codes:
    200: 100

Report @ 17:45:11(-0300) 2021-10-16
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10.01
  Response time (msec):
    min: 900
    max: 906
    median: 901
    p95: 902.5
    p99: 905
  Codes:
    200: 100

Report @ 17:45:21(-0300) 2021-10-16
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 903
    median: 901
    p95: 901
    p99: 902.5
  Codes:
    200: 100

Report @ 17:45:31(-0300) 2021-10-16
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 906
    median: 901
    p95: 901
    p99: 904
  Codes:
    200: 100

Report @ 17:45:41(-0300) 2021-10-16
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 100

Report @ 17:45:51(-0300) 2021-10-16
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 905
    median: 901
    p95: 902
    p99: 904
  Codes:
    200: 100

Report @ 17:46:01(-0300) 2021-10-16
Elapsed time: 2 minutes, 30 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 903
    median: 901
    p95: 901.5
    p99: 903
  Codes:
    200: 100

Report @ 17:46:11(-0300) 2021-10-16
Elapsed time: 2 minutes, 40 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 903
    median: 901
    p95: 901.5
    p99: 903
  Codes:
    200: 100

Report @ 17:46:21(-0300) 2021-10-16
Elapsed time: 2 minutes, 50 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 100

Report @ 17:46:31(-0300) 2021-10-16
Elapsed time: 3 minutes, 0 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 100

Report @ 17:46:41(-0300) 2021-10-16
Elapsed time: 3 minutes, 10 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901.5
  Codes:
    200: 100

Report @ 17:46:51(-0300) 2021-10-16
Elapsed time: 3 minutes, 20 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901.5
  Codes:
    200: 100

Report @ 17:47:01(-0300) 2021-10-16
Elapsed time: 3 minutes, 30 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 100

Report @ 17:47:11(-0300) 2021-10-16
Elapsed time: 3 minutes, 40 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 903
    median: 901
    p95: 901
    p99: 903
  Codes:
    200: 100

Report @ 17:47:21(-0300) 2021-10-16
Elapsed time: 3 minutes, 50 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 903
    median: 901
    p95: 901
    p99: 902.5
  Codes:
    200: 100

Report @ 17:47:31(-0300) 2021-10-16
Elapsed time: 4 minutes, 0 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 908
    median: 901
    p95: 901
    p99: 905
  Codes:
    200: 100

Report @ 17:47:41(-0300) 2021-10-16
Elapsed time: 4 minutes, 10 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 906
    median: 901
    p95: 901
    p99: 904.5
  Codes:
    200: 100

Report @ 17:47:51(-0300) 2021-10-16
Elapsed time: 4 minutes, 20 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 100

Report @ 17:48:01(-0300) 2021-10-16
Elapsed time: 4 minutes, 30 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901.5
  Codes:
    200: 100

Report @ 17:48:11(-0300) 2021-10-16
Elapsed time: 4 minutes, 40 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 903
    median: 901
    p95: 902
    p99: 903
  Codes:
    200: 100

Report @ 17:48:21(-0300) 2021-10-16
Elapsed time: 4 minutes, 50 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10.01
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901.5
  Codes:
    200: 100

Report @ 17:48:31(-0300) 2021-10-16
Elapsed time: 5 minutes, 0 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 904
    median: 901
    p95: 901
    p99: 903
  Codes:
    200: 100

Report @ 17:48:41(-0300) 2021-10-16
Elapsed time: 5 minutes, 10 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 908
    median: 901
    p95: 902
    p99: 906
  Codes:
    200: 100

Report @ 17:48:51(-0300) 2021-10-16
Elapsed time: 5 minutes, 20 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10.01
  Response time (msec):
    min: 900
    max: 905
    median: 901
    p95: 902
    p99: 904
  Codes:
    200: 100

Report @ 17:49:01(-0300) 2021-10-16
Elapsed time: 5 minutes, 30 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 906
    median: 901
    p95: 902
    p99: 904
  Codes:
    200: 100

Report @ 17:49:11(-0300) 2021-10-16
Elapsed time: 5 minutes, 40 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901.5
    p99: 902
  Codes:
    200: 100

Report @ 17:49:21(-0300) 2021-10-16
Elapsed time: 5 minutes, 50 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10.01
  Response time (msec):
    min: 900
    max: 904
    median: 901
    p95: 901.5
    p99: 903.5
  Codes:
    200: 100

Report @ 17:49:31(-0300) 2021-10-16
Elapsed time: 6 minutes, 0 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901.5
  Codes:
    200: 100

Report @ 17:49:41(-0300) 2021-10-16
Elapsed time: 6 minutes, 10 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901.5
  Codes:
    200: 100

Report @ 17:49:51(-0300) 2021-10-16
Elapsed time: 6 minutes, 20 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 100

Report @ 17:50:01(-0300) 2021-10-16
Elapsed time: 6 minutes, 30 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 905
    median: 901
    p95: 901
    p99: 903.5
  Codes:
    200: 100

Report @ 17:50:11(-0300) 2021-10-16
Elapsed time: 6 minutes, 40 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901.5
  Codes:
    200: 100

Report @ 17:50:21(-0300) 2021-10-16
Elapsed time: 6 minutes, 50 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 100

Report @ 17:50:31(-0300) 2021-10-16
Elapsed time: 7 minutes, 0 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10.01
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901.5
  Codes:
    200: 100

Report @ 17:50:41(-0300) 2021-10-16
Elapsed time: 7 minutes, 10 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 904
    median: 901
    p95: 901
    p99: 903
  Codes:
    200: 100

Report @ 17:50:51(-0300) 2021-10-16
Elapsed time: 7 minutes, 20 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 907
    median: 901
    p95: 901
    p99: 904
  Codes:
    200: 100

Report @ 17:51:01(-0300) 2021-10-16
Elapsed time: 7 minutes, 30 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10.01
  Response time (msec):
    min: 900
    max: 903
    median: 901
    p95: 901
    p99: 902.5
  Codes:
    200: 100

Report @ 17:51:11(-0300) 2021-10-16
Elapsed time: 7 minutes, 40 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 100

Report @ 17:51:21(-0300) 2021-10-16
Elapsed time: 7 minutes, 50 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10.01
  Response time (msec):
    min: 900
    max: 913
    median: 901
    p95: 901
    p99: 909
  Codes:
    200: 100

Report @ 17:51:31(-0300) 2021-10-16
Elapsed time: 8 minutes, 0 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 100

Report @ 17:51:41(-0300) 2021-10-16
Elapsed time: 8 minutes, 10 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 906
    median: 901
    p95: 901.5
    p99: 904
  Codes:
    200: 100

Report @ 17:51:51(-0300) 2021-10-16
Elapsed time: 8 minutes, 20 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 904
    median: 901
    p95: 901
    p99: 903
  Codes:
    200: 100

Report @ 17:52:01(-0300) 2021-10-16
Elapsed time: 8 minutes, 30 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 100

Report @ 17:52:11(-0300) 2021-10-16
Elapsed time: 8 minutes, 40 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 903
    median: 901
    p95: 901
    p99: 902.5
  Codes:
    200: 100

Report @ 17:52:21(-0300) 2021-10-16
Elapsed time: 8 minutes, 50 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10.01
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901.5
  Codes:
    200: 100

Report @ 17:52:31(-0300) 2021-10-16
Elapsed time: 9 minutes, 0 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901.5
  Codes:
    200: 100

Report @ 17:52:41(-0300) 2021-10-16
Elapsed time: 9 minutes, 10 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 100

Report @ 17:52:51(-0300) 2021-10-16
Elapsed time: 9 minutes, 20 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901.5
  Codes:
    200: 100

Report @ 17:53:01(-0300) 2021-10-16
Elapsed time: 9 minutes, 30 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901.5
  Codes:
    200: 100

Report @ 17:53:11(-0300) 2021-10-16
Elapsed time: 9 minutes, 40 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 100

Report @ 17:53:21(-0300) 2021-10-16
Elapsed time: 9 minutes, 50 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10.01
  Response time (msec):
    min: 900
    max: 904
    median: 901
    p95: 902
    p99: 903.5
  Codes:
    200: 100

Report @ 17:53:31(-0300) 2021-10-16
Elapsed time: 10 minutes, 0 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 100

Started phase 1 (End), duration: 10s @ 17:53:31(-0300) 2021-10-16
Report @ 17:53:41(-0300) 2021-10-16
Elapsed time: 10 minutes, 10 seconds
  Scenarios launched:  1
  Scenarios completed: 10
  Requests completed:  10
  Mean response/sec: 0.1
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 10

Report @ 17:53:41(-0300) 2021-10-16
Elapsed time: 10 minutes, 10 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

All virtual users finished
Summary report @ 17:53:42(-0300) 2021-10-16
  Scenarios launched:  6000
  Scenarios completed: 6000
  Requests completed:  6000
  Mean response/sec: 9.83
  Response time (msec):
    min: 900
    max: 922
    median: 901
    p95: 902
    p99: 903
  Scenario counts:
    Root (/): 6000 (100%)
  Codes:
    200: 6000